Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4682.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0SID3" edc:desc="" edc:mask="0x1" edc:name="RXB0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID4" edc:desc="" edc:mask="0x1" edc:name="RXB0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID5" edc:desc="" edc:mask="0x1" edc:name="RXB0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID6" edc:desc="" edc:mask="0x1" edc:name="RXB0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID7" edc:desc="" edc:mask="0x1" edc:name="RXB0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID8" edc:desc="" edc:mask="0x1" edc:name="RXB0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID9" edc:desc="" edc:mask="0x1" edc:name="RXB0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID10" edc:desc="" edc:mask="0x1" edc:name="RXB0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrr-rr" edc:cname="RXB0SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXB0SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xF62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0EID16" edc:desc="" edc:mask="0x1" edc:name="RXB0EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID17" edc:desc="" edc:mask="0x1" edc:name="RXB0EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0EXID" edc:desc="" edc:mask="0x1" edc:name="RXB0EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SRR" edc:desc="" edc:mask="0x1" edc:name="RXB0SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID0" edc:desc="" edc:mask="0x1" edc:name="RXB0SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID1" edc:desc="" edc:mask="0x1" edc:name="RXB0SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID2" edc:desc="" edc:mask="0x1" edc:name="RXB0SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0EID8" edc:desc="" edc:mask="0x1" edc:name="RXB0EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID9" edc:desc="" edc:mask="0x1" edc:name="RXB0EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID10" edc:desc="" edc:mask="0x1" edc:name="RXB0EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID11" edc:desc="" edc:mask="0x1" edc:name="RXB0EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID12" edc:desc="" edc:mask="0x1" edc:name="RXB0EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID13" edc:desc="" edc:mask="0x1" edc:name="RXB0EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID14" edc:desc="" edc:mask="0x1" edc:name="RXB0EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID15" edc:desc="" edc:mask="0x1" edc:name="RXB0EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0EID0" edc:desc="" edc:mask="0x1" edc:name="RXB0EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID1" edc:desc="" edc:mask="0x1" edc:name="RXB0EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID2" edc:desc="" edc:mask="0x1" edc:name="RXB0EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID3" edc:desc="" edc:mask="0x1" edc:name="RXB0EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID4" edc:desc="" edc:mask="0x1" edc:name="RXB0EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID5" edc:desc="" edc:mask="0x1" edc:name="RXB0EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID6" edc:desc="" edc:mask="0x1" edc:name="RXB0EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID7" edc:desc="" edc:mask="0x1" edc:name="RXB0EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="RXB0DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu" edc:name="RXB0DLC" edc:nzwidth="0x8" edc:por="0xxxxxxx" edc:_addr="0xF65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0DLC0" edc:desc="" edc:mask="0x1" edc:name="RXB0DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0DLC1" edc:desc="" edc:mask="0x1" edc:name="RXB0DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0DLC2" edc:desc="" edc:mask="0x1" edc:name="RXB0DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0DLC3" edc:desc="" edc:mask="0x1" edc:name="RXB0DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0RB0" edc:desc="" edc:mask="0x1" edc:name="RXB0RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0RB1" edc:desc="" edc:mask="0x1" edc:name="RXB0RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0RTR" edc:desc="" edc:mask="0x1" edc:name="RXB0RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D00" edc:desc="" edc:mask="0x1" edc:name="RXB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D01" edc:desc="" edc:mask="0x1" edc:name="RXB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D02" edc:desc="" edc:mask="0x1" edc:name="RXB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D03" edc:desc="" edc:mask="0x1" edc:name="RXB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D04" edc:desc="" edc:mask="0x1" edc:name="RXB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D05" edc:desc="" edc:mask="0x1" edc:name="RXB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D06" edc:desc="" edc:mask="0x1" edc:name="RXB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D07" edc:desc="" edc:mask="0x1" edc:name="RXB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D10" edc:desc="" edc:mask="0x1" edc:name="RXB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D11" edc:desc="" edc:mask="0x1" edc:name="RXB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D12" edc:desc="" edc:mask="0x1" edc:name="RXB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D13" edc:desc="" edc:mask="0x1" edc:name="RXB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D14" edc:desc="" edc:mask="0x1" edc:name="RXB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D15" edc:desc="" edc:mask="0x1" edc:name="RXB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D16" edc:desc="" edc:mask="0x1" edc:name="RXB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D17" edc:desc="" edc:mask="0x1" edc:name="RXB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D20" edc:desc="" edc:mask="0x1" edc:name="RXB0D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D21" edc:desc="" edc:mask="0x1" edc:name="RXB0D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D22" edc:desc="" edc:mask="0x1" edc:name="RXB0D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D23" edc:desc="" edc:mask="0x1" edc:name="RXB0D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D24" edc:desc="" edc:mask="0x1" edc:name="RXB0D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D25" edc:desc="" edc:mask="0x1" edc:name="RXB0D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D26" edc:desc="" edc:mask="0x1" edc:name="RXB0D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D27" edc:desc="" edc:mask="0x1" edc:name="RXB0D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF69">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D30" edc:desc="" edc:mask="0x1" edc:name="RXB0D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D31" edc:desc="" edc:mask="0x1" edc:name="RXB0D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D32" edc:desc="" edc:mask="0x1" edc:name="RXB0D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D33" edc:desc="" edc:mask="0x1" edc:name="RXB0D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D34" edc:desc="" edc:mask="0x1" edc:name="RXB0D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D35" edc:desc="" edc:mask="0x1" edc:name="RXB0D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D36" edc:desc="" edc:mask="0x1" edc:name="RXB0D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D37" edc:desc="" edc:mask="0x1" edc:name="RXB0D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D40" edc:desc="" edc:mask="0x1" edc:name="RXB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D41" edc:desc="" edc:mask="0x1" edc:name="RXB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D42" edc:desc="" edc:mask="0x1" edc:name="RXB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D43" edc:desc="" edc:mask="0x1" edc:name="RXB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D44" edc:desc="" edc:mask="0x1" edc:name="RXB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D45" edc:desc="" edc:mask="0x1" edc:name="RXB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D46" edc:desc="" edc:mask="0x1" edc:name="RXB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D47" edc:desc="" edc:mask="0x1" edc:name="RXB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D50" edc:desc="" edc:mask="0x1" edc:name="RXB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D51" edc:desc="" edc:mask="0x1" edc:name="RXB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D52" edc:desc="" edc:mask="0x1" edc:name="RXB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D53" edc:desc="" edc:mask="0x1" edc:name="RXB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D54" edc:desc="" edc:mask="0x1" edc:name="RXB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D55" edc:desc="" edc:mask="0x1" edc:name="RXB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D56" edc:desc="" edc:mask="0x1" edc:name="RXB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D57" edc:desc="" edc:mask="0x1" edc:name="RXB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
